---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalNodeData
source: html/28349e43-304c-e561-512d-5507982fd782.htm
---
# AnalyticalNodeData Properties

Specifies whether the .NET object represents a valid Revit entity.